mrnoise/MicroTrait/MSP430/PMM/Pmm.hpp
/** @defgroup groupMSP430 MSP430
* MSP430 specific code
*/

/** @defgroup groupMSP430Pmm PMM
 *  @ingroup groupMSP430
* @brief functions for PMM(power management module) register access for TIs MSP430 -> Ti Driverlib equivalent naming
*
* @details
* Usage: \code {.cpp}

#include "MicroTrait/MT.hpp"

using namespace MT::MSP430;

 Pmm pmm{};
 pmm.unlockLPM5();

\endcode
*
* @author Steffen Fuchs
*<br> Email: admin@definefalsetrue.com
*<br> Web: https://definefalsetrue.com
*
****************************************************************
*/


/** @defgroup groupFuncsMSP430Pmm Functions
*  @ingroup groupMSP430Pmm
*  Functions in this module
*/

/** @defgroup groupEnumsMSP430Pmm Enums
*  @ingroup groupMSP430Pmm
*  Enums in this module
*/

#ifndef MICROTRAIT_MSP430_PMM_PMM_HPP_
#define MICROTRAIT_MSP430_PMM_PMM_HPP_

#include "MicroTrait/MSP430/Settings.hpp"
#include "MicroTrait/MSP430/Types.hpp"

#ifdef MT_USE_MSP430_LIB

#include "MicroTrait/Universal/Register.hpp"
#include <msp430.h>
#include <utility>
#include <type_traits>

#if defined(__MSP430_HAS_PMM__) || defined(__MSP430_HAS_PMM_FR5xx__) || defined(__MSP430_HAS_PMM_FRAM__)

namespace MT {
namespace Misc {

#if defined(__MSP430_HAS_PMM_FRAM__)
    enum class PMM_INT : uint16_t {
        BOR  = (PMMBORIFG),
        RST  = (PMMRSTIFG),
        POR  = (PMMPORIFG),
        SVSH = (SVSHIFG),
        LPM5 = (PMMLPM5IFG),
        ALL  = (0xA7)
    };
    template<>
    struct enable_Enum_bits<PMM_INT> {
        static constexpr bool enable = true;
    };
#endif

#if defined(__MSP430_HAS_PMM_FR5xx__)
    enum class PMM_INT : uint16_t {
        BOR  = (PMMBORIFG),
        RST  = (PMMRSTIFG),
        POR  = (PMMPORIFG),
        SVSH = (SVSHIFG),
        SVSH = (SVSLIFG),
        LPM5 = (PMMLPM5IFG),
        ALL  = (0xB7)
    };
    template<>
    struct enable_Enum_bits<PMM_INT> {
        static constexpr bool enable = true;
    };
#endif

#if defined(__MSP430F5XX_6XX_FAMILY__)
    enum class PMM_INT : uint16_t {
        SVSM_LOWSIDE_DELY_EXP  = (SVSMLDLYIFG),
        SVM_LOWSIDE            = (SVMLIFG),
        SVM_LOWSIDE_REACHED    = (SVMLVLRIFG),
        SVSM_HIGHSIDE_DELY_EXP = (SVSMHDLYIFG),
        SVM_HIGHSIDE           = (SVMHIFG),
        SVM_HIGHSIDE_REACHED   = (SVMHVLRIFG),
        BOR                    = (PMMBORIFG),
        RST                    = (PMMRSTIFG),
        POR                    = (PMMPORIFG),
        SVS_HIGHSIDE           = (SVSHIFG),
        SVS_LOWSIDE            = (SVSLIFG),
        LPM5                   = (PMMLPM5IFG)
    };
    template<>
    struct enable_Enum_bits<PMM_INT> {
        static constexpr bool enable = true;
    };
#endif

#if defined(__MSP430_HAS_MSP430I_CPU__)
    enum class PMM_INT : uint16_t {
        VMON  = (VMONIE),
        LPM45 = (LPM45IFG)
    };
    template<>
    struct enable_Enum_bits<PMM_INT> {
        static constexpr bool enable = true;
    };
#endif

}// namespace Misc

namespace MSP430 {
    namespace PMM {

        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief PMM interrupt types
		****************************************************************
		*/
        using INT = MT::Misc::PMM_INT;

#if defined(__MSP430FR2XX_4XX_FAMILY__)
        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief Bandgap mode
		****************************************************************
		*/
        enum class BANDGAP_MODE : uint_fast8_t {
            STATIC = 0,
            SAMPLE
        };

        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief Bandgap active or not
		****************************************************************
		*/
        enum class BANDGAP : uint_fast8_t {
            INACTIVE = 0,
            ACTIVE
        };

        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief Reference generator active or not
		****************************************************************
		*/
        enum class REFGEN : uint_fast8_t {
            INACTIVE = 0,
            ACTIVE
        };

        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief Bandgap status
		****************************************************************
		*/
        enum class BANDGAP_STATUS : uint_fast8_t {
            NOTREADY = 0,
            READY
        };

        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief reference generator status
		****************************************************************
		*/
        enum class REFGEN_STATUS : uint_fast8_t {
            NOTREADY = 0,
            READY
        };

#if defined(REFVSEL)
        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief reference voltage selection
		****************************************************************
		*/
        enum class REF_VOLT_SELECT : uint16_t {
            V1_5 = (REFVSEL_0),
            V2_0 = (REFVSEL_1),
            V2_5 = (REFVSEL_2)
        };
#endif
#endif

#if defined(__MSP430F5XX_6XX_FAMILY__)

        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief core voltage selection
		****************************************************************
		*/
        enum class COREVOLT : uint16_t {
            LEVEL0 = (PMMCOREV_0),
            LEVEL1 = (PMMCOREV_1),
            LEVEL2 = (PMMCOREV_2),
            LEVEL2 = (PMMCOREV_3)
        };
#endif


#if defined(__MSP430_HAS_MSP430I_CPU__)
        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief voltage monitor
		****************************************************************
		*/
        enum class VOLT_MONITOR : uint16_t {
            DISABLE       = (VMONLVL_0),
            DVCC_2350MV   = (VMONLVL_1),
            DVCC_2650MV   = (VMONLVL_2),
            DVCC_2850MV   = (VMONLVL_3),
            VMONIN_1160MV = (VMONLVL_7)
        };

        /**
		* @ingroup groupEnumsMSP430Pmm
		****************************************************************
		* @brief voltage monitor
		****************************************************************
		*/
        enum class REGULATOR : uint8_t {
            ON  = (0x00),
            OFF = (0x10)
        };
#endif

    }// namespace PMM

    struct Pmm {

