mrnoise/MicroTrait/MSP430/PMM/Pmm.hpp
      private:
#if defined(__MSP430_HAS_PMM_FR5xx__) || defined(__MSP430_HAS_PMM_FRAM__) || defined(__MSP430F5XX_6XX_FAMILY__)
        MT::Universal::Register<&PMMCTL0_L> m_ctl0{};
        MT::Universal::Register<&PMMCTL0_H> m_ctl0pwd{};
        MT::Universal::Register<&PMMCTL1>   m_ctl1{};
        MT::Universal::Register<&PMMIFG>    m_if{};
        MT::Universal::Register<&PM5CTL0>   m_lpm5{};

#if defined(__MSP430_HAS_PMM_FR5xx__) || defined(__MSP430_HAS_PMM_FRAM__)
        MT::Universal::Register<&PMMCTL2> m_ctl2{};
#endif

#if defined(__MSP430F5XX_6XX_FAMILY__)
        MT::Universal::Register<&SVSMHCTL> m_svsmh{};
        MT::Universal::Register<&SVSMLCTL> m_svsml{};
        MT::Universal::Register<&SVSMIO>   m_svsmio{};
        MT::Universal::Register<&PMMRIE>   m_ie{};
#endif
#endif

#if defined(__MSP430_HAS_MSP430I_CPU__)
        MT::Universal::Register<&LPM45CTL> m_lpm45{};
        MT::Universal::Register<&VMONCTL>  m_vmon{};
        MT::Universal::Register<&REFCAL0>  m_rcal0{};
        MT::Universal::Register<&REFCAL1>  m_rcal1{};
#endif


      public:
#if defined(__MSP430_HAS_MSP430I_CPU__)

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief sets up the voltage monitor
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.setupVoltageMonitor(PMM::VOLT_MONITOR::DVCC_2350MV); \endcode
		*@param mon new voltage monitor level
		****************************************************************
		*/
        constexpr void setupVoltageMonitor(const PMM::VOLT_MONITOR mon) noexcept {
            uint8_t currentStatus = m_vmon.get();
            currentStatus &= ~(0x07);
            currentStatus |= static_cast<uint8_t>(mon);
            m_vmon.override(currentStatus);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  sets up the calibration of the internal reference
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.calibrateReference(); \endcode
		*
		****************************************************************
		*/
        constexpr void calibrateReference() noexcept {
            m_rcal0.override(TLV_START + TLV_CAL_REFCAL0);
            m_rcal1.override(TLV_START + TLV_CAL_REFCAL1);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief sets the status of the PMM regulator
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.setRegulatorStatus(PMM::REGULATOR::ON); \endcode
		*@param reg regulator on or off
		****************************************************************
		*/
        constexpr void setRegulatorStatus(const PMM::REGULATOR reg) noexcept {
            uint8_t currentStatus = m_lpm45.get();
            currentStatus &= ~(PMMREGOFF);
            currentStatus |= static_cast<uint8_t>(reg);
            m_lpm45.override(currentStatus);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  unlocks the IO
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.unlockIOConfiguration(); \endcode
		*
		****************************************************************
		*/
        constexpr void unlockIOConfiguration() noexcept {
            m_lpm45.clear(LOCKLPM45);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  enables interrupts
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableInterrupt(PMM::INT::LPM45); \endcode
		*
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        constexpr void enableInterrupt(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
            m_vmon.set(bit, bits...);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  disables interrupts
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableInterrupt(PMM::INT::LPM45); \endcode
		*@tparam BITS use enumeration PMM::INT
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        constexpr void disableInterrupt(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
            m_vmon.clear(bit, bits...);
        }


        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  disables interrupts
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableInterrupt(PMM::INT::LPM45); \endcode
		*@tparam BITS use enumeration PMM::INT
		*@return if all the given bits are set or not (INT_MASK_MATCH)
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        constexpr INT_MASK_MATCH disableInterrupt(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");

            const BIT     sum  = MT::Details::orSum(bit, bits...);
            const uint8_t mask = static_cast<uint8_t>(sum);

            if ((mask & PMM_VMON_INTERRUPT) && (VMONCTL & VMONIFG)) return INT_MASK_MATCH::TRUE;
            else if (mask & PMM_LPM45_INTERRUPT)
                return INT_MASK_MATCH::TRUE;

            return INT_MASK_MATCH::FALSE;
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  disables interrupts
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableInterrupt(PMM::INT::LPM45); \endcode
		*@tparam BITS use enumeration PMM::INT
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        constexpr void clearInterrupt(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
            const BIT     sum  = MT::Details::orSum(bit, bits...);
            const uint8_t mask = static_cast<uint8_t>(sum);
            m_lpm45.clear(mask);
        }


#endif

#if defined(__MSP430F5XX_6XX_FAMILY__)
        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief enables the low-side SVM circuitry
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSVML(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSVML() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.set(SVMLE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables the low-side SVM circuitry
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSVML(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSVML() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.clear(SVMLE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief enables the high-side SVM circuitry
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSVMH(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSVMH() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsmh.set(SVMHE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables the high-side SVM circuitry
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSVMH(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSVMH() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsmh.clear(SVMHE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief enables the low-side SVS and SVM circuitry
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvsLSvmL(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvsLSvmL() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.set(SVSLE + SVMLE);
            m_ctl0pwd.override(0x00);
        }

        /**
        * @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables the low-side SVS and SVM circuitry
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvsLSvmL(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvsLSvmL() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.clear(SVSLE + SVMLE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief enables the high-side SVS and SVM circuitry
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvsHSvmH(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvsHSvmH() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsmh.set(SVSHE + SVMHE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables the high-side SVS and SVM circuitry
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvsHSvmH(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvsHSvmH() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsmh.clear(SVSHE + SVMHE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  enables the POR signal generation when a low-voltage event is registered by the low-side SVS
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvsLReset(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvsLReset() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ie.set(SVSLPE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  disables the POR signal generation when a low-voltage event is registered by the low-side SVS
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvsLReset(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvsLReset() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ie.clear(SVSLPE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief enables the interrupt generation when a low-voltage event is registered by the low-side SVM
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvmLInterrupt(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvmLInterrupt() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ie.set(SVMLIE);
            m_ctl0pwd.override(0x00);
        }


        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables the interrupt generation when a low-voltage event is registered by the low-side SVM
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvmLInterrupt(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvmLInterrupt() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ie.clear(SVMLIE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief enables the POR signal generation when a low-voltage event is registered by the high-side SVS
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvsHReset(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvsHReset() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ie.set(SVSHPE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables the POR signal generation when a low-voltage event is registered by the high-side SVS
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvsHReset(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvsHReset() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ie.clear(SVSHPE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief enables the interrupt generation when a low-voltage event is registered by the high-side SVM
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvmHInterrupt(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvmHInterrupt() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ie.set(SVMHIE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables the interrupt generation when a low-voltage event is registered by the high-side SVM
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvmHInterrupt(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvmHInterrupt() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ie.clear(SVMHIE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief clear all interrupt flags for the PMM
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.clearPMMIFGS(); \endcode
		*
		****************************************************************
		*/
        constexpr void clearPMMIFGS() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_if.override(0);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  enables supervisor low side in LPM with twake-up-fast from LPM2, LPM3, and LPM4
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvsLInLPMFastWake(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvsLInLPMFastWake() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.set(SVSLFP + SVSLMD);
            m_svsml.clear(SVSMLACE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  enables supervisor low side in LPM with twake-up-slow from LPM2, LPM3, and LPM4
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvsLInLPMSlowWake(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvsLInLPMSlowWake() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.set(SVSLMD);
            m_svsml.clear(SVSLFP + SVSMLACE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  disables supervisor low side in LPM with twake-up-fast from LPM2, LPM3, and LPM4
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvsLInLPMFastWake(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvsLInLPMFastWake() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.set(SVSLFP);
            m_svsml.clear(SVSLMD + SVSMLACE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  disables supervisor low side in LPM with twake-up-slow from LPM2, LPM3, and LPM4
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvsLInLPMSlowWake(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvsLInLPMSlowWake() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.clear(VSLFP + SVSMLACE + SVSLMD);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  Enables supervisor high side in LPM with tpd = 20 s
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvsHInLPMNormPerf(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvsHInLPMNormPerf() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsmh.set(SVSHMD);
            m_svsmh.clear(SVSMHACE + SVSHFP);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief  Enables supervisor high side in LPM with tpd = 2.5 s
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSvsHInLPMFullPerf(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSvsHInLPMFullPerf() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsmh.set(SVSHMD + SVSHFP);
            m_svsmh.clear(SVSMHACE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables supervisor high side in LPM with tpd = 20 s
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvsHInLPMNormPerf(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvsHInLPMNormPerf() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsmh.clear(SVSMHACE + SVSHFP + SVSHMD);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables supervisor high side in LPM with tpd = 2.5 s
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSvsHInLPMFullPerf(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSvsHInLPMFullPerf() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsmh.set(SVSHFP);
            m_svsmh.clear(SVSMHACE + SVSHMD);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief optimized to provide twake-up-fast from LPM2, LPM3, and LPM4 with least power
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.optimizeSvsLInLPMFastWake(); \endcode
		*
		****************************************************************
		*/
        constexpr void optimizeSvsLInLPMFastWake() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.set(SVSLFP + SVSLMD + SVSMLACE);
            m_ctl0pwd.override(0x00);
        }


        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief optimized to provide tpd = 2.5 s in LPM with least power
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.optimizeSvsHInLPMFullPerf (); \endcode
		*
		****************************************************************
		*/
        constexpr void optimizeSvsHInLPMFullPerf() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_svsml.set(SVSHMD + SVSHFP + SVSMHACE);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Decrease Vcore by one level
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  if(pmm.setVCoreDown(PMM::COREVOLT::LEVEL0) == STATUS::FAIL) doSomething(); \endcode
		*@param lev level to which Vcore needs to be decreased (PMM::COREVOLT)
		*@return the status of the cmoannd execution(STATUS)
		****************************************************************
		*/
        [[nodiscard]] constexpr STATUS setVCoreDown(PMM::COREVOLT lev) noexcept {

