mrnoise/MicroTrait/MSP430/PMM/Pmm.hpp
            //The code flow for increasing the Vcore has been altered to work around
            //the erratum FLASH37.
            //Please refer to the Errata sheet to know if a specific device is affected
            //DO NOT ALTER THIS FUNCTION

            typedef typename std::underlying_type<PMM::COREVOLT>::type underlying;

            //Open PMM registers for write access
            m_ctl0pwd.override(PMMPW_H);

            //Disable dedicated Interrupts
            //Backup all registers
            const uint16_t PMMRIE_backup = m_ie.get();
            m_ie.clear(SVMHVLRPE | SVSHPE | SVMLVLRPE | SVSLPE | SVMHVLRIE | SVMHIE | SVSMHDLYIE | SVMLVLRIE | SVMLIE | SVSMLDLYIE);

            uint16_t SVSMHCTL_backup = m_svsmh.get();
            uint16_t SVSMLCTL_backup = m_svsml.get();

            m_if.override(0);//Clear flags
            //Set SVM highside to new level and check if a VCore increase is possible

            m_svsmh.override(SVMHE | SVSHE | (SVSMHRRL0 * static_cast<underlying>(lev)));

            //Wait until SVM highside is settled
            while (!m_if.compare(SVSMHDLYIFG))
                ;
            m_if.clear(SVSMHDLYIFG);

            //Check if a VCore increase is possible
            if (m_if.compare(SVMHIFG)) {

                m_if.clear(SVSMHDLYIFG);
                m_svsmh.override(SVSMHCTL_backup);

                //Wait until SVM highside is settled
                while (!m_if.compare(SVSMHDLYIFG) == 0)
                    ;

                m_if.clear(SVMHVLRIFG | SVMHIFG | SVSMHDLYIFG | SVMLVLRIFG | SVMLIFG | SVSMLDLYIFG);
                //Restore PMM interrupt enable register
                m_ie.override(PMMRIE_backup);

                m_ctl0pwd.override(0x00);
                return STATUS::FAIL;
            }

            //Set also SVS highside to new level
            //Vcc is high enough for a Vcore increase
            m_svsmh.override(SVSMHRRL0 * static_cast<underlying>(lev));

            //Wait until SVM highside is settled
            while (!m_if.compare(SVSMHDLYIFG))
                ;
            m_if.clear(SVSMHDLYIFG);

            m_ctl0.override(PMMCOREV0 * static_cast<underlying>(lev));

            //Set SVM, SVS low side to new level
            m_svsml.override(SVMLE | (SVSMLRRL0 * static_cast<underlying>(lev)) | SVSLE | (SVSLRVL0 * static_cast<underlying>(lev)));

            //Wait until SVM highside is settled
            while (!m_if.compare(SVSMLDLYIFG))
                ;
            m_if.clear(SVSMLDLYIFG);

            //Restore Low side settings
            //Clear all other bits _except_ level settings
            m_svsml.clear(SVSLRVL0 + SVSLRVL1 + SVSMLRRL0 + SVSMLRRL1 + SVSMLRRL2);

            //Clear level settings in the backup register,keep all other bits
            SVSMLCTL_backup &= ~(SVSLRVL0 + SVSLRVL1 + SVSMLRRL0 + SVSMLRRL1 + SVSMLRRL2);

            //Restore low-side SVS monitor settings
            m_svsml.override(SVSMLCTL_backup);

            //Restore High side settings
            //Clear all other bits except level settings
            m_svsmh.clear(SVSHRVL0 + SVSHRVL1 + SVSMHRRL0 + SVSMHRRL1 + SVSMHRRL2);

            //Clear level settings in the backup register,keep all other bits
            SVSMHCTL_backup &= ~(SVSHRVL0 + SVSHRVL1 + SVSMHRRL0 + SVSMHRRL1 + SVSMHRRL2);
            m_svsmh.set(SVSMHCTL_backup);//Restore backup

            //Wait until high side, low side settled
            while ((!m_if.compare(SVSMLDLYIFG)) || (!m_if.compare(SVSMHDLYIFG)))
                ;
            m_if.clear(SVMHVLRIFG | SVMHIFG | SVSMHDLYIFG | SVMLVLRIFG | SVMLIFG | SVSMLDLYIFG);
            m_ie.override(PMMRIE_backup);
            m_ctl0pwd.override(0x00);
            return STATUS::SUCCESS;
        }


        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Increase Vcore by one level
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  if(pmm.setVCoreUp(PMM::COREVOLT::LEVEL0) == STATUS::FAIL) doSomething(); \endcode
		*@param lev level to which Vcore needs to be increased (PMM::COREVOLT)
		*@return the status of the cmoannd execution(STATUS)
		****************************************************************
        */
        [[nodiscard]] constexpr STATUS setVCoreUp(PMM::COREVOLT lev) noexcept {

            //The code flow for increasing the Vcore has been altered to work around
            //the erratum FLASH37.
            //Please refer to the Errata sheet to know if a specific device is affected
            //DO NOT ALTER THIS FUNCTION

            typedef typename std::underlying_type<PMM::COREVOLT>::type underlying;

            //Open PMM registers for write access
            m_ctl0pwd.override(PMMPW_H);

            //Disable dedicated Interrupts
            //Backup all registers
            const uint16_t PMMRIE_backup = m_ie.get();
            m_ie.clear(SVMHVLRPE | SVSHPE | SVMLVLRPE | SVSLPE | SVMHVLRIE | SVMHIE | SVSMHDLYIE | SVMLVLRIE | SVMLIE | SVSMLDLYIE);

            uint16_t SVSMHCTL_backup = m_svsmh.get();
            uint16_t SVSMLCTL_backup = m_svsml.get();

            m_if.clear(SVMHIFG | SVSMHDLYIFG | SVMLIFG | SVSMLDLYIFG);//Clear flags

            //Set SVM, SVS high & low side to new settings in normal mode
            m_svsmh.override(SVMHE | (SVSMHRRL0 * static_cast<underlying>(lev)) | SVSHE | (SVSHRVL0 * static_cast<underlying>(lev)));
            m_svsml.override(SVMLE | (SVSMLRRL0 * static_cast<underlying>(lev)) | SVSLE | (SVSLRVL0 * static_cast<underlying>(lev)));

            while ((!m_if.compare(SVSMHDLYIFG)) || (!m_if.compare(SVSMLDLYIFG)))
                ;
            m_if.clear(SVSMHDLYIFG + SVSMLDLYIFG);

            //Set VCore to new level
            m_ctl0.override(PMMCOREV0 * static_cast<underlying>(lev));

            //Restore Low side settings
            //Clear all other bits _except_ level settings
            m_svsml.clear(SVSLRVL0 + SVSLRVL1 + SVSMLRRL0 + SVSMLRRL1 + SVSMLRRL2);

            //Clear level settings in the backup register,keep all other bits
            SVSMLCTL_backup &= ~(SVSLRVL0 + SVSLRVL1 + SVSMLRRL0 + SVSMLRRL1 + SVSMLRRL2);

