mrnoise/MicroTrait/MSP430/PMM/Pmm.hpp
            //Restore low-side SVS monitor settings
            m_svsml.set(SVSMLCTL_backup);

            //Restore High side settings
            //Clear all other bits except level settings
            m_svsmh.clear(SVSHRVL0 + SVSHRVL1 + SVSMHRRL0 + SVSMHRRL1 + SVSMHRRL2);

            //Clear level settings in the backup register,keep all other bits
            SVSMHCTL_backup &= ~(SVSHRVL0 + SVSHRVL1 + SVSMHRRL0 + SVSMHRRL1 + SVSMHRRL2);
            m_svsmh.set(SVSMHCTL_backup);//Restore backup


            //Wait until high side, low side settled
            while ((!m_if.compare(SVSMLDLYIFG)) || (!m_if.compare(SVSMHDLYIFG)))
                ;

            m_if.clear(SVMHVLRIFG | SVMHIFG | SVSMHDLYIFG | SVMLVLRIFG | SVMLIFG | SVSMLDLYIFG);
            m_ie.override(PMMRIE_backup);
            m_ctl0pwd.override(0x00);
            return STATUS::SUCCESS;
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Increase Vcore by one level
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  if(pmm.setVCore(PMM::COREVOLT::LEVEL0) == STATUS::FAIL) doSomething(); \endcode
		*@param lev level to which Vcore needs to be decreased/increased (PMM::COREVOLT)
		*@return the status of the cmoannd execution(STATUS)
		****************************************************************
	    */
        [[nodiscard]] constexpr STATUS setVCore(PMM::COREVOLT lev) noexcept {

            STATUS status = STATUS::SUCCESS;

            typedef typename std::underlying_type<PMM::COREVOLT>::type underlying;

            const uint16_t level = static_cast<underlying>(lev);

            //Set Mask for Max. level
            level &= PMMCOREV_3;

            //Get actual VCore
            uint16_t actlevel = (m_ctl0.get() & PMMCOREV_3);

            //Disable interrupts because certain peripherals will not
            //work during VCORE change
            const uint16_t interruptState = __get_interrupt_state();
            __disable_interrupt();
            __no_operation();

            //step by step increase or decrease
            while ((level != actlevel) && (status == STATUS::SUCCESS)) {
                if (level > actlevel) {
                    status = setVCoreUp(static_cast<PMM::COREVOLT>(++actlevel));
                } else {
                    status = setVCoreDown(static_cast<PMM::COREVOLT>(--actlevel));
                }
            }

            //Re-enable interrupt state to whatever it was before
            if (interruptState & GIE) {
                __enable_interrupt();
            }

            return status;
        }


#endif

#if defined(__MSP430_HAS_PMM_FR5xx__) || (defined(__MSP430F5XX_6XX_FAMILY__))
        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief enables the voltage supervisor low side
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSVSL(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSVSL() noexcept {
            m_ctl0pwd.override(PMMPW_H);
#if defined(__MSP430F5XX_6XX_FAMILY__)
            m_svsml.set(SVSLE);
#else
            m_ctl0.set(SVSLE);
#endif
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables the voltage supervisor low side
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSVSL(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSVSL() noexcept {
            m_ctl0pwd.override(PMMPW_H);
#if defined(__MSP430F5XX_6XX_FAMILY__)
            m_svsml.clear(SVSLE);
#else
            m_ctl0.clear(SVSLE);
#endif
            m_ctl0pwd.override(0x00);
        }
#endif

#if defined(__MSP430_HAS_PMM_FRAM__) || (defined(__MSP430F5XX_6XX_FAMILY__))
        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief enables the voltage supervisor high side
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableSVSH(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableSVSH() noexcept {
            m_ctl0pwd.override(PMMPW_H);
#if defined(__MSP430F5XX_6XX_FAMILY__)
            m_svsmh.set(SVSHE);
#else
            m_ctl0.set(SVSHE);
#endif
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief disables the voltage supervisor high side
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableSVSH(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableSVSH() noexcept {
            m_ctl0pwd.override(PMMPW_H);
#if defined(__MSP430F5XX_6XX_FAMILY__)
            m_svsmh.clear(SVSHE);
#else
            m_ctl0.clear(SVSHE);
#endif
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief compares the given pins with the interrupt flags set in the hw register
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  if(pmm.getInterruptStatus(PMM::INT::BOR | PMM::INT::POR) == INT_MASK_MATCH::TRUE) doSomething(); \endcode
		*@tparam BITS use enumeration PMM::INT
		*@return if all the given bits are set or not (INT_MASK_MATCH)
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        [[nodiscard]] constexpr INT_MASK_MATCH getInterruptStatus(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
            if (m_if.compare(bit, bits...)) return INT_MASK_MATCH::TRUE;
            else
                return INT_MASK_MATCH::FALSE;
        }
#endif

#if defined(__MSP430_HAS_PMM_FRAM__) || (__MSP430_HAS_PMM_FR5xx__)


        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Makes the LDO remain ON when going into LPM 3/4
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.turnOnRegulator(); \endcode
		*
		****************************************************************
		*/
        constexpr void turnOnRegulator() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ctl0.clear(PMMREGOFF);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Turns off the LDO when going into LPM3/4, thus the system will enter LPM3.5 or LPM4.5 respectively
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.turnOffRegulator(); \endcode
		*
		****************************************************************
		*/
        constexpr void turnOffRegulator() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ctl0.set(PMMREGOFF);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief triggers a software Power On Reset (POR)
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.trigPOR(); \endcode
		*
		****************************************************************
		*/
        constexpr void trigPOR() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ctl0.set(PMMSWPOR);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief triggers a software Brown Out Rest (BOR)
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.trigBOR(); \endcode
		*
		****************************************************************
		*/
        constexpr void trigBOR() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ctl0.set(PMMSWBOR);
            m_ctl0pwd.override(0x00);
        }


        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief clears the interrupt flags for the given mask
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.clearInterrupt(PMM::INT::BOR | PMM::INT::POR); \endcode
		*@tparam BITS use enumeration PMM::INT
		****************************************************************
		*/
        template<typename BIT, typename = typename std::enable_if<MT::Misc::enable_Enum_bits<BIT>::enable, BIT>::type, typename... BITS>
        constexpr void clearInterrupt(const BIT &bit, const BITS &... bits) noexcept {
            static_assert(std::is_same<MT::MSP430::PMM::INT, BIT>::value, "input must be PMM::INT enum");
            m_ctl0pwd.override(PMMPW_H);
            m_if.clear(bit, bits...);
            m_ctl0pwd.override(0x00);
        }


        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Disable the GPIO power-on default high-impedance mode to activate previously configured port settings
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.unlockLPM5(); \endcode
		*
		****************************************************************
		*/
        constexpr void unlockLPM5() noexcept {
            m_lpm5.clear(LOCKLPM5);
        }
#endif

#if defined(__MSP430FR2XX_4XX_FAMILY__)
        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief returns the bandgap mode of the PMM module
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  if(pmm.getBandgapMode() == PMM::BANDGAP_MODE::SAMPLE) doSomething(); \endcode
		*@return the curretn bandgap mode (PMM::BANDGAP_MODE)
		****************************************************************
		*/
        [[nodiscard]] constexpr PMM::BANDGAP_MODE getBandgapMode() noexcept {

