mrnoise/MicroTrait/MSP430/PMM/Pmm.hpp
            if (m_ctl2.compare(BGMODE)) return PMM::BANDGAP_MODE::SAMPLE;
            else
                return PMM::BANDGAP_MODE::STATIC;
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief returns the active status of the bandgap in the PMM module
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  if(pmm.isBandgapActive() == PMM::BANDGAP::ACTIVE) doSomething(); \endcode
		*@return if the bandgap is active or not (PMM::BANDGAP)
		****************************************************************
		*/
        [[nodiscard]] constexpr PMM::BANDGAP isBandgapActive() noexcept {

            if (m_ctl2.compare(REFBGACT)) return PMM::BANDGAP::ACTIVE;
            else
                return PMM::BANDGAP::INACTIVE;
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief the active status of the reference generator in the PMM module
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  if(pmm.isRefGenActive() == PMM::BANDGAP::ACTIVE) doSomething(); \endcode
		*@return if the reference generator is active or not (PMM::REFGEN)
		****************************************************************
		*/
        [[nodiscard]] constexpr PMM::REFGEN isRefGenActive() noexcept {

            if (m_ctl2.compare(REFGENACT)) return PMM::REFGEN::ACTIVE;
            else
                return PMM::REFGEN::INACTIVE;
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief returns the active status of the buffered bandgap voltage in the PMM
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  if(pmm.getBufferedBandgapVoltageStatus() == PMM::BANDGAP_STATUS::READY) doSomething(); \endcode
		*@return if the bandgap status is ready or not (PMM::BANDGAP_STATUS)
		****************************************************************
		*/
        [[nodiscard]] constexpr PMM::BANDGAP_STATUS getBufferedBandgapVoltageStatus() noexcept {

            if (m_ctl2.compare(REFBGRDY)) return PMM::BANDGAP_STATUS::READY;
            else
                return PMM::BANDGAP_STATUS::NOTREADY;
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief returns the status of the variable reference voltage in the PMM
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  if(pmm.getVariableReferenceVoltageStatus() == PMM::REFGEN_STATUS::READY) doSomething(); \endcode
		*@return if the variable reference status is ready or not(PMM::REFGEN_STATUS)
		****************************************************************
		*/
        [[nodiscard]] constexpr PMM::REFGEN_STATUS getVariableReferenceVoltageStatus() noexcept {

            if (m_ctl2.compare(REFGENRDY)) return PMM::REFGEN_STATUS::READY;
            else
                return PMM::REFGEN_STATUS::NOTREADY;
        }


        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Disables the internal temperature sensor to save power consumption
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableTempSensor(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableTempSensor() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ctl2.clear(TSENSOREN);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Enables the internal temperature sensor to save power consumption
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableTempSensor(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableTempSensor() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ctl2.set(TSENSOREN);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Disables the external reference output
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableExternalReference(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableExternalReference() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ctl2.clear(EXTREFEN);
            m_ctl0pwd.override(0x00);
        }

        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Enables the external reference output
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.enableExternalReference(); \endcode
		*
		****************************************************************
		*/
        constexpr void enableExternalReference() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ctl2.set(EXTREFEN);
            m_ctl0pwd.override(0x00);
        }


        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Disables the internal reference output
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.disableInternalReference(); \endcode
		*
		****************************************************************
		*/
        constexpr void disableInternalReference() noexcept {
            m_ctl0pwd.override(PMMPW_H);
            m_ctl2.clear(INTREFEN);
            m_ctl0pwd.override(0x00);
        }

#if defined(REFVSEL)
        /**
		* @ingroup groupFuncsMSP430Pmm
		****************************************************************
		* @brief Selects reference voltage level
		* @details
		* Usage: \code {.cpp}
		* using namespace MT::MSP430;
		*
		*  Pmm pmm{};
		*  pmm.selectVoltageReference(PMM::REF_VOLT_SELECT::V1_5); \endcode
		*
		****************************************************************
		*/
        constexpr void selectVoltageReference(const PMM::REF_VOLT_SELECT sel) noexcept {
            m_ctl2.clear(REFVSEL);
            typedef typename std::underlying_type<PMM::REF_VOLT_SELECT>::type underlying;
            m_ctl2.set(static_cast<underlying>(sel));
        }
#endif
#endif
    };

}// namespace MSP430
}// namespace MT

#endif
#endif
#endif /* MICROTRAIT_MSP430_PMM_PMM_HPP_ */
